app/controllers/api/v1/auth_controller.rb

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES ('testgm', '$2a$12$GUSxtL7qA0bqdwsiw6YfUurNPNxmNutGZFKVNxIqfxNpR/LV2WqqW', '2026-03-04 04:17:20.050501', '2026-03-04 04:17:20.050501') RETURNING "id"
---
      def register
        user = User.new(name: params[:name], password: params[:password])

        if user.save

SELECT "users".* FROM "users" WHERE "users"."name" = 'testgm' LIMIT 1
---
      def login
        user = User.find_by(name: params[:name])