app/controllers/api/v1/base_controller.rb

      def authenticate_user!
        token = request.headers["Authorization"]&.split(" ")&.last
        payload = JwtHelper.decode(token) if token
        @current_user = User.find_by(id: payload[:user_id]) if payload
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1