app/controllers/api/v1/campaigns_controller.rb

SELECT "campaign_memberships".* FROM "campaign_memberships" WHERE "campaign_memberships"."user_id" = 4
---
      def index
        memberships = current_user.campaign_memberships.includes(:campaign)
        campaigns = memberships.map do |m|

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = 2
---
      def show
        campaign = Campaign.find(params[:id])

INSERT INTO "campaigns" ("name", "invite_code", "created_at", "updated_at") VALUES ('My Campaign', 'koIMlpl6', '2026-03-04 04:20:34.898034', '2026-03-04 04:20:34.898034') RETURNING "id"
INSERT INTO "campaign_memberships" ("user_id", "campaign_id", "role", "created_at", "updated_at") VALUES (3, 2, 'gm', '2026-03-04 04:20:34.921585', '2026-03-04 04:20:34.921585') RETURNING "id"
---
      def create
        campaign = Campaign.new(name: params[:name])

        if campaign.save
          campaign.campaign_memberships.create!(user: current_user, role: "gm")

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."invite_code" = 'koIMlpl6' LIMIT 1
SELECT "campaign_memberships".* FROM "campaign_memberships" WHERE "campaign_memberships"."user_id" = 4 AND "campaign_memberships"."campaign_id" = 2 LIMIT 1
INSERT INTO "campaign_memberships" ("user_id", "campaign_id", "role", "created_at", "updated_at") VALUES (4, 2, 'player', '2026-03-04 04:20:35.409584', '2026-03-04 04:20:35.409584') RETURNING "id"
---
      def join
        campaign = Campaign.find_by(invite_code: params[:invite_code])
        return render json: { error: "Invalid invite code" }, status: :not_found unless campaign

        existing = current_user.campaign_memberships.find_by(campaign_id: campaign.id)
        return render json: { error: "Already a member" }, status: :conflict if existing

        membership = campaign.campaign_memberships.create!(user: current_user, role: "player")