app/controllers/api/v1/campaign_scoped_controller.rb

      def set_campaign
        @campaign = Campaign.find(params[:campaign_id])
---
SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = 2 LIMIT 1

      def set_membership
        @membership = current_user.campaign_memberships.find_by(campaign_id: @campaign.id)
---
SELECT "campaign_memberships".* FROM "campaign_memberships" WHERE "campaign_memberships"."user_id" = 3 AND "campaign_memberships"."campaign_id" = 2 LIMIT 1