app/controllers/api/v1/hexes_controller.rb

SELECT "hexes".* FROM "hexes" WHERE "hexes"."map_id" = 2
SELECT "hexes".* FROM "hexes" WHERE "hexes"."map_id" = 2 AND "hexes"."active" = TRUE
---
      def index
        hexes = @map.hexes.includes(:terrain_type, player_notes: :user)
        hexes = hexes.active unless @membership.role == "gm"

        render json: hexes.map { |h| hex_json(h) }

SELECT "hexes".* FROM "hexes" WHERE "hexes"."map_id" = 2 AND "hexes"."id" = 10 LIMIT 1
UPDATE "hexes" SET "status" = 'explored', "name" = 'Golden Fields', "description" = 'Rolling plains of golden wheat.', "updated_at" = '2026-03-04 04:21:23.250149' WHERE "hexes"."id" = 10
---
      def update
        hex = @map.hexes.find(params[:id])

        if hex.update(hex_params)

SELECT "maps".* FROM "maps" WHERE "maps"."campaign_id" = 2 AND "maps"."id" = 2 LIMIT 1
---
      def set_map
        @map = @campaign.maps.find(params[:map_id])

SELECT "player_notes".* FROM "player_notes" WHERE "player_notes"."hex_id" = 10
---
      def gm_hex_json(hex)
        {
          id: hex.id,
          q: hex.q,
          r: hex.r,
          active: hex.active,
          status: hex.status,
          terrain_type: hex.terrain_type ? terrain_type_json(hex.terrain_type) : nil,
          name: hex.name,
          description: hex.description,
          player_notes: hex.player_notes.map { |n| note_json(n) }