app/controllers/api/v1/maps_controller.rb

SELECT "maps".* FROM "maps" WHERE "maps"."campaign_id" = 2 AND "maps"."published" = TRUE
---
      def index
        maps = @campaign.maps
        maps = maps.where(published: true) unless @membership.role == "gm"
        render json: maps.map { |m| map_json(m) }

INSERT INTO "maps" ("campaign_id", "name", "grid_cols", "grid_rows", "published", "created_at", "updated_at") VALUES (2, 'World Map', 3, 3, FALSE, '2026-03-04 04:20:35.474835', '2026-03-04 04:20:35.474835') RETURNING "id"
---
      def create
        map = @campaign.maps.new(map_params)

        if map.save

UPDATE "maps" SET "published" = TRUE, "updated_at" = '2026-03-04 04:20:35.592879' WHERE "maps"."id" = 2
---
      def update
        if @map.update(update_params)

SELECT "maps".* FROM "maps" WHERE "maps"."campaign_id" = 2 AND "maps"."id" = 2 LIMIT 1
---
      def set_map
        @map = @campaign.maps.find(params[:id])