app/controllers/api/v1/player_notes_controller.rb

SELECT "player_notes".* FROM "player_notes" WHERE "player_notes"."hex_id" = 10 AND "player_notes"."user_id" = 4 LIMIT 1
---
      def create
        note = @hex.player_notes.find_or_initialize_by(user: current_user)

SELECT "maps".* FROM "maps" WHERE "maps"."campaign_id" = 2 AND "maps"."id" = 2 LIMIT 1
SELECT "hexes".* FROM "hexes" WHERE "hexes"."map_id" = 2 AND "hexes"."id" = 10 LIMIT 1
---
      def set_hex
        map = @campaign.maps.find(params[:map_id])
        @hex = map.hexes.find(params[:hex_id])