app/controllers/api/v1/terrain_types_controller.rb

      def index
        terrain_types = @campaign.terrain_types
        render json: terrain_types.map { |tt| terrain_type_json(tt) }
---
SELECT "terrain_types".* FROM "terrain_types" WHERE "terrain_types"."campaign_id" = 2