app/models/campaign.rb

  def seed_default_terrain_types
    rows = DEFAULT_TERRAIN_TYPES.map do |tt|
      tt.merge(campaign_id: id, built_in: true, created_at: Time.current, updated_at: Time.current)
    end
    TerrainType.insert_all(rows)
---
INSERT INTO "terrain_types" ("name","color","icon","campaign_id","built_in","created_at","updated_at") VALUES ('Plains', '#C8D96F', '🌾', 1, TRUE, '2026-03-04 04:16:10.001130', '2026-03-04 04:16:10.001134'), ('Forest', '#2D6A4F', '🌲', 1, TRUE, '2026-03-04 04:16:10.001138', '2026-03-04 04:16:10.001139'), ('Mountain', '#6B7280', '⛰️', 1, TRUE, '2026-03-04 04:16:10.001141', '2026-03-04 04:16:10.001142'), ('Hills', '#92794A', '🏔️', 1, TRUE, '2026-03-04 04:16:10.001144', '2026-03-04 04:16:10.001144'), ('Desert', '#D4A853', '🏜️', 1, TRUE, '2026-03-04 04:16:10.001146', '2026-03-04 04:16:10.001147'), ('Ocean', '#1E6FA8', '🌊', 1, TRUE, '2026-03-04 04:16:10.001148', '2026-03-04 04:16:10.001149'), ('Swamp', '#5C6B2E', '🌿', 1, TRUE, '2026-03-04 04:16:10.001162', '2026-03-04 04:16:10.001163'), ('Tundra', '#CBD5E0', '❄️', 1, TRUE, '2026-03-04 04:16:10.001164', '2026-03-04 04:16:10.001165'), ('Settlement', '#B45309', '🏘️', 1, TRUE, '2026-03-04 04:16:10.001166', '2026-03-04 04:16:10.001167') ON CONFLICT  DO NOTHING RETURNING "id"