app/models/map.rb

INSERT INTO "hexes" ("map_id","q","r","active","status","created_at","updated_at") VALUES (1, 0, 0, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 1, 0, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 2, 0, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 0, 1, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 1, 1, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 2, 1, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 0, 2, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 1, 2, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246'), (1, 2, 2, FALSE, 'unrevealed', '2026-03-04 04:16:10.415246', '2026-03-04 04:16:10.415246') ON CONFLICT  DO NOTHING RETURNING "id"
---
  def seed_hexes
    now = Time.current
    rows = []
    grid_rows.times do |r|
      grid_cols.times do |q|
        rows << {
          map_id: id,
          q: q,
          r: r,
          active: false,
          status: "unrevealed",
          created_at: now,
          updated_at: now
        }
      end
    end
    Hex.insert_all(rows)